Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/mortgage_arrears/mortgage_arrears_resolution_process.html.txt.tmx
Source language: en
Languages: ga

source: There must be a written procedure for handling appeals, to include:
ga: Ní mór go mbeidh nós imeachta i scríbhinn ann chun achomhairc a láimhseáil, leis an méid a leanas a áireamh:

source: • Only written appeals will be considered
ga: • Ní dhéanfar breithniú ach ar achomhairc i scríbhinn

source: • Appeals will be acknowledged in writing within 5 business days of being received
ga: • Aithneofar achomhairc i scríbhinn laistigh de 5 lá gnó tar éis go bhfaightear iad

source: • The lender must give you the name of one or more people who will be your point of contact in relation to the complaint until the Appeals Board has ruled on it
ga: • Ní mór don iasachtóir ainm duine amháin nó níos mó a thabhairt duit a bheidh mar do phointe teagmhála maidir leis an ngearán go dtí go dtugann an Bord Achomhairc a rialáil air

source: The appeal must be decided within 40 business days of being received
ga: Ní mór cinneadh a dhéanamh ar an achomharc laistigh de 40 lá gnó tar éis go bhfaightear é

source: The lender must write to you within 5 business days of this, to convey the decision of the Appeals Board and explain the terms of any offer being made
ga: Ní mór don iasachtóir scríobh chugat laistigh de 5 lá gnó faoi seo, chun cinneadh an Bhoird Achomhairc a chur in iúl duit agus chun téarmaí aon tairisceana a mhíniú atá á déanamh

source: The lender must also inform you of your right to refer the matter to the Financial Services Ombudsman and must give you the Ombudsman’s contact details
ga: Ní mór don iasachtóir thú a chur ar an eolas, chomh maith, ar an gceart atá agat an cheist a atreorú chuig Ombudsman um Sheirbhísí Airgeadais agus ní mór dó/di sonraí teagmhála an Ombudsman a thabhairt duit

source: The lender must give you written updates on the progress of the appeal at least every 20 business days
ga: Ní mór don iasachtóir nuashonruithe scríofa a thabhairt duit ar dhul chun cinn an achomhairc ar a laghad gach 20 lá gnó

source: If you are not happy with the lender’s treatment of your case, or if you feel they have not complied with the CCMA, you can complain to the lender under the Central Bank’s Consumer Protection Code
ga: Mura bhfuil tú sásta leis an mbealach atá an t-iasachtóir ag caitheamh le do chás, nó má bhraitheann tú nár chloígh siad leis an CIRM, féadfaidh tú gearán a dhéanamh leis an iasachtóir faoi Chód um Chosaint Tomhaltóirí an Bhainc Cheannais 2012

source: If you are not happy with the outcome of an appeal or complaint, you can refer to the Financial Services Ombudsman
ga: Mura bhfuil tú sásta le toradh achomhairc nó gearáin, féadfaidh tú an cheist a chur faoi bhráid an Ombudsman um Sheirbhísí Airgeadais

source: The lender must not apply to the courts to commence legal action for repossession of your property until every reasonable effort has been made to agree an alternative arrangement and a specified time period has elapsed
ga: Níor cheart go ndéanfadh an t-iasachtóir iarratas ar na cúirteanna chun tús a chur le gníomhaíocht dhlíthiúil le haghaidh athshealbhú do mhaoine go dtí go ndéantar gach iarracht réasúnta chun socrú eile a chomhaontú agus go dtí go bhfuil tréimhse shonraithe tar éis dul in éag

source: In general, if you are co-operating with the lender, they must wait at least 8 months from the date your arrears were classified as a MARP case - see 'Communication' above - before applying to the courts
ga: Go ginearálta, má tá tú ag comhoibriú leis an iasachtóir, ní mór dóibh fanacht ar a laghad 8 mí ón dáta a rangaíodh gur chás PRRM a bhí i do chuid riaráistí (31 lá tar éis an chéid aisíocaíochta nach ndearnadh) sula ndéanann siad iarratas ar na cúirteanna

source: This 8-month period does not apply if you do not co-operate with the lender; or if you perpetrate a fraud on the lender; or if there is a breach of contract by you other than the existence of arrears - in such cases, repossession proceedings can be started immediately
ga: Ní bhíonn an tréimhse 8 mí seo i gceist mura gcomhoibríonn tú leis an iasachtóir; nó má dhéanann tú calaois ar an iasachtóir; nó má sháraíonn tú an conradh, ar bhealach eile seachas riaráistí a chruthú – sna cásanna siúd, féadtar tús a chur le himeachtaí athshealbhaithe láithreach bonn

source: However, before you can be classified as not co-operating, your lender must first write to you and warn you that this might happen and tell you what steps you need to take to avoid being classified as not co-operating
ga: Sular féidir thú a rangú gan bheith ag comhoibriú, áfach, ní mór do d’iasachtóir scríobh chugat agus an foláireamh a thabhairt duit go bhféadfadh seo tarlú agus insint duit cén céimeanna is gá duit glacadh d’fhonn nach ndéanfar thú a rangú gan bheith ag comhoibriú

source: For co-operating borrowers, if your lender does not offer you an alternative repayment arrangement, or if you do not accept an alternative repayment arrangement being offered, your lender must write to you as outlined in 'Resolution' above
ga: I gcás iasachtaithe a chomhoibríonn, mura gcuireann d’iasachtóir socrú eile aisíocaíochta ar fáil duit, nó mura nglacann tú le socrú eile aisíocaíochta atá á chur ar fáil, ní mór do d’iasachtóir scríobh chugat, amhail a shonraítear faoi ‘Réiteach’ thuas

source: As regards repossession, this letter must state:
ga: Maidir le cúrsaí athshealbhaithe, ní mór go luaitear an méid a leanas sa litir seo:

source: • That you are now outside the MARP, and that its protections no longer apply
ga: • Go bhfuil tú anois lasmuigh den PRRM, agus nach bhfuil tú faoina chosaint a thuilleadh

source: • That legal proceedings may start 3 months from the date that the letter is issued or 8 months from the date the arrears arose, whichever date is later
ga: • Féadtar tús a chur le himeachtaí dlí trí mhí ón dáta a eisítear an litir nó ocht mí ón dáta a cruthaíodh na riaráistí, pé dáta is déanaí

source: The 3 months will give you time to consider other options, such as voluntary surrender, voluntary sale (pdf) or a Personal Insolvency Arrangement. You can also appeal the lender’s decision under the CCMA’s appeals process, described above
ga: Tabharfaidh na trí mhí seo roinnt ama duit chun machnamh a dhéanamh ar roghanna eile, ar nós géilleadh deonach, díol deonach nó Socrú um Dhócmhainneacht Phearsanta

source: The lender or its legal advisers must notify you in writing immediately before applying to the Courts to start any legal action on repossession
ga: Ina theannta sin, féadfaidh tú cinneadh an iasachtóra achomharc faoi phróiseas achomhairc an CIRM, amhail a shonraítear thuas

source: Even at this late stage, you may be able to access free legal aid and advice to help with your situation. There is also a national network of court mentors, which offers support and advice for borrowers on court proceedings, as well as direct referral back to MABS
ga: Ní mór don iasachtóir nó dá c(h)omhairleoirí dlí thú a chur ar an eolas i scríbhinn sula ndéantar iarratas ar na Cúirteanna chun tús a chur le gníomhaíocht dlí maidir le hathshealbhú

source: Your property may be repossessed either by voluntary agreement or by court order - see our document on repossession
ga: Is féidir do mhaoin a athshealbhú trí chomhaontú deonach nó trí ordú cúirte - féach ár ndoiciméad maidir le hathshealbhú tí

source: Even if court proceedings are started, the lender must still try to maintain contact with you to seek an agreement on repayments, and must put legal proceedings on hold if agreement is reached
ga: Fiú má chuirtear tús le himeachtaí cúirte, ní mór don iasachtóir iarracht a dhéanamh teagmháil a choimeád leat fós chun chomhaontú maidir le haisíocaíochtaí a lorg, agus ní mór imeachtaí dlí a chur ar fheitheamh má dhéantar comhaontú

source: The lender must explain to you that, if the property is sold and the sale price does not cover the amount you owe, you are still liable for the rest of the amount you owe
ga: Má dhíoltar an mhaoin agus mura gclúdaíonn an praghas díola an méid atá dlite agat, tá tú fós faoi dhliteanas i leith an chuid eile den mhéid atá dlite agat
